#pragma once
#include <iostream>
#define NUM 100
#define BUFF_SIZE 256

char recvLib[NUM][BUFF_SIZE] = 
{
	{"你好"},
	{"你叫什么"},
	{"我是谁"},
	{ "你吃饭了吗" },
	{ "我喜欢你" },
	{ "我最喜欢谁" },
	{ "你会写代码吗" },
	{ "我们出去吃饭吧" },
	{ "给我讲个笑话" },
	{ "给我唱首歌" },
	{ "你多大了" },
	{ "你喜欢什么" }
};

char sendLib[NUM][BUFF_SIZE] =
{
	{"你好"},
	{"聊天机器人呀"},
	{"你不说我怎么知道。。。"},
	{ "我靠电补充身体能量" },
	{ "可是你的通讯录快捷键里面有别的人……" },
	{ "你喜欢我呀" },
	{ "我不太会呢，以后有机会要学习一下，嘻嘻" },
	{ "嗯，去吧，我还没起床呢" },
	{ "“大夫，请问我这颗痣是美人痣吗？” “小姐，一般认为长在眉心的或者嘴旁的痣才是美人痣。你这个位置……在医学上称为痔疮。”" },
	{ "我很会唱歌的哦，你喜欢听什么歌吔" },
	{ "我四岁了" },
	{ "吃饭睡觉，和陪你～" }
};

char* reply(char *recvBuff)
{
	for(int i = 0; i < NUM; i++)
	{
		//如果这一行有内容
		if(recvBuff[i])
		{
			//判断是否找到了匹配的对话内容
			if(strcmp(recvBuff,recvLib[i]) == 0)
			{
				return sendLib[i];
			}
		}
		else
			break;
	}
	return "我不知道说什么了";
}